from django.shortcuts import render,redirect
from django.contrib.auth.forms import UserCreationForm
from django.contrib.auth.decorators import login_required
import random


def indexView(request):
	return render(request,'index.html')

@login_required
def dashboardView(request):
    return render(request,'dashboard.html')	

def registerView(request):
	if request.method == "POST":
		form = UserCreationForm(request.POST)
		if form.is_valid():
			form.save()
			return redirect('login_url')
	else:
		form = UserCreationForm()
	return render(request,'registration/register.html',{"form":form})


abraj=[' برج الحمل ',' برج الثور ',' برج الجوزاء ',' برج السرطان ',' برج الأسد ',' برج العذراء  ',' برج الميزان ',' برج العقرب ',' برج القوس ','  برج الجدي ',' برج الدلو  ',' برج الحوت  ']
pay = ['Paypal','Paysera','Payoneer','Bitcoin','Perfect money']
foll=[' اشتراك ليوم واحد ب 2 دولار ',' اشتراك لاسبوع واحد ب 10 دولار ',' اشتراك لشهر واحد ب 30 دولار ',' اشتراك لسنة واحدة ب 200 دولار ']
def payment(request):
    return render(request,'registration/login2.html',{"abraj":abraj,"pay":pay,"foll":foll})



def showmessage(request):
    liste=[
           "بدأ مواليد برج العذراء الاحتفال بأعياد ميلادهم، ذلك البرج الترابي الذي يتصف مواليده بقدرتهم على التكيف مع ما حولهم من ظروف، فضلًا عن نقدهم الدائم لكل ما يحدث حولهم  رغبة في تسليط الضوء على شخصيته  وهو ",
		   " توقعات علماء الفلك وحظك اليوم لمواليد برج الميزان على الصعيد المهنى والصحى والعاطفى، وهو من الأبراج الهوائية ويتصف مواليده بحب بالدبلوماسية والعدل ولديهم حالة من المرح والفكاهة وحب  ",
		   " ابدأ بحدث مهم لك هو دخول كوكب فينوس إلى برجك بتاریخ 7، إذ يعدك بأوقات عذبة ولقاءات مهمة مع حبيب محتمل، أو بوضع إستنائي تعيشه في هذا الشهر. قد تقع في الغرام الفجائي، ما يحدث صدمة في حياتك، وسط مناخ فلكي ما زال دقيقة. تقول الكواكب إن هناك انعطافات عاطفية في حياتك أو جديد يدخل على علاقتك أو حتا ينمو مع صديق أو صديقة قديمة. قد تم بتجربة عاطفية إستثنائية وترتبك أمام ما يحصل معك أو يهرك شخص يتمتع بثقافة عالية أو معرفة حكيمة. وربما يجذبك عالم الفنون الراقية ويوحي لك بالكثير. إذا كنت من المبدعين فقد ترعى في هذا الوقت مشروع مهما أو تتوصل إلى اكتشافات مذهلة في هذا المجال. قد تميل إلى أشخاص موهوبين لورون بعض أفكارك أو يتجاوبون مع تطلعاتك.  ",
		   " تهتم ربما بوضع صخي يخص أحد المقربين و الذي يحتاج إلى مساعدتك، فالأوضاع الفلكية تناقضة جدا وتحمل المفاجآت وتحملك ما يجب قوله إنك تمر بتجارب دفيقة وذلك على كل الأصعدة، وقد يحصل في حياتك ما هو مفاجئ وغير منتظر ويقلب كل الموازينا الحاقات إلا أن هذا الشهر يشير أيضاً إلى إعادة النظر بعض القناعات أو المشاريع والطوالع الفلكية توحي بحركة كبيرة في حياتك، وقد تت بعض الارباكات، خاصةً لمواليد الدائرة الثالثة الذين  "," إذا كان کوکب مارس يبعث في نفسك الحماسة لا داعي للقلق، رغم أن بعض الأمور قد تتعرقل في هذا الشهر أو توحي بعض الجمود، ما يسمح لك بإعادة النظر ببعض المشاريع ووضع اللمس المتينة لها. تسير الأمور على نغمة إيجابية رغم كل شيء، وقد يح لك الأفلاك تحقيق بعض الرغبات في الأسبوعين الأول والأخير. إسترح ولا تعلق أهمية على بعض المناوشات التي يفتعلها الآخرون، وحاذر من بعض التهور الذي يسببه کوکب مارس في برج الحمل. ",
		   " إن الطالع الفلكي الجيد الذي يحدثه جوبيتير مع نبتون يكون على انسجام معك، خاصة إذا كنت من مواليد الدائرة الثالثة، ويولد جواً من الدفء والثقة ويجعلك معتز بنفسك مترنسا بعض اللجان أو الأعمال. إنه الوقت الملائم لكي تتقدم بطلب و تظهر عن كفاءة وتدافع عن وجهة نظر بقناعة كلية. قد يتسبب کو کب مارس في الحمل بنزاعات أو بحوادث في هذا الشهر، ومواجهات على الصعيد الشخصي والعائلي. لكن فترة جيدة عاطفيا تبدأ بتاریخ 8 وتستمر حتى الأسبوع الأول من الشهر المقبل. تعيش أوقات إستثنائية مع المقربين ويعبر لك الحبيب أو الشريك عن عطف إستثنائي وإعجاب بشخصك يرضيك جداً.  قد تنشأ صداقة جديدة في هذا الشهر أو ترى أن من حولك يحاول إسعادك بكل الوسائل. ربما تقوم بسفر جميل أو تعرف لقاء يطربك، خاصة ًإذا كنت من مواليد الدائرة الأولى حيث يكون العشق في أوجه. وإذا كنت عازب فقد تعرف لقاء مع شخص يثير إعجابك ويجعلك مقداما تعبر عن مشاعرك بدون تحفظات "," على موعد معك. يجب أن تتصرف بسرعة في هذه الأثناء وأن لا تفوت بعض الفرص، فتضاعف الجهود وتسير على نمط أقل بطأ من السابق و أكثر حركة وانتباه لما يدور حولك. لا تخف من قول ما تريد وبصوت عالٍ، خاصةً إذا كان عليك الدفاع عن مظلوم أو عن فكرة نزيهة تراها ضرورية. قد تغيّر عاداتك أيضا وتقرر مثلا أن تسافر بحثاً عن راحة تحتاجها وتستحقها. تنفتح على آفاق جديدة كما على معتقدات و تتوق إلى دراسة بعض الأديان مثلا أو الفلسفات التي لا تعرفها. يغمرك الوحي لكي تقدم عملاً خلاقاً، خاصة إذا كنت تنتمي إلى عالم الصحافة أو الكتابة أو الإنتاج الفني أو التربوي . من الممكن أن تنتشر أعمالك في الخارج أو أن تنفتح أنت على بعض الأوساط الأجنبية والتي توفر لك فرصة التعرف إلى جديد. في العمل تكشف القناع ناع عمن يحاول ممارسة لطة لا يقرنها بالعدل والإنصاف. قد توقع على عقد أيضا أو تستقل بعملك بعيدا عن الإلتزامات السابقة والروتينية. ترغب بالتحرر بكل الأحوال وفك القيود عنك. بعض مواليد الحوت يخضعون لتأثيرات حدث خارجي يجعلهم يغيرون مكان عملهم أو نوعه. لكن ما استطيع قوله أن كل هذه التقلبات، والتي قد تفاجئك، تخدم في النهاية مصالحك. " ,
		   " تتوسع دائرة علاقاتك الشخصية وتقدم على علاقات منفتحة و حوارات ودية ولقاءات نعش القلب. تشارك بمناسبات وربما تعرف مغامرة في الأسبوع الأخير، تقودك إلى البعيد، فكوكب فينوس يترك أخيرة برج الجوزاء لينتقل إلى موقع مناسب لك هو السرطان، في حين أن جوبيتير في الجدي يتناغم مع نبتون، فيوحي هذا المشهد الفلكي بحظ يخيم عليك وبنقاشات فكرية وثقافية تجذبك جداً. لكن أدعوك إلى الحذر من بعض الأوهام وبعض التشت الفكري أحياناً وخاصة في الأسبوع الأخير. قد تتلقى دعوة مهمة أو تجتمع مع فرقاء لبحث خطة عمل. فقد تلتقي بمن يخفق له قلبك، أو تقيم علاقة مذهلة وغريبة بعض الشيء، أو تنزوي بعيداً عن الناس مع نفسك. إلا أنك تستعيد الإشراق وتنفتح على كل جديد إبتداء من تاریخ 7، فتقدم على مغامرة أو تتشوق اللقاءات ومناسبات تلتقي فيها بمن تحب.   "," تتمتع بجاذبية إستثنائية تجعلك تمارس هواياتك في شتى الميادين بثقة بالنفس وتتحرك مدعوما من الشمس في الأسد، و کوکب مارس في الحمل، اللذين يشعلان حماستك ويشيران إلى مشروع تطرح بصورة إستثنائية وإلى سفر ميز يحمل إليك جديدة. مهما إستدعى العمل جهودا فإنك تبذلها بلا وتحصل على نجاح كبيراً شهر متحرك جدا يحمل مفاجآت في كل مراحله، ويثير حولك التساؤلات كما الغيرة ويجعلك تطيب الخواطر وتتفهم الطبيعة البشرية التي تنتقد دائما نجاح الآخرين. عليك أن تساير وأن تتقبل حتى بعض الإنتقادات والتهكمات بدون جواب أو إستفزاز. ركز على مشاريع التي تبدو مزدهرة حتى أواخر الشهر، وكن حريصا على سلامة اتصالاتك وحاول أن تحسن أسلوبك مع الناس. يساعدك على ذلك الشك الكبير في معرفة طباع الآخرين، فتبدل طریقتك حسب الظروف والأشخاص. قد تلقى في الأسبوع الأول مبلغ من المال أو تكسب بعض الأرباح ويطرأ اللامنتظر احياناً.  " ,
		   " تتمتع بجاذبية إستثنائية تجعلك تمارس هواياتك في شتى الميادين بثقة بالنفس وتتحرك مدعوما من الشمس في الأسد، و کوکب مارس في الحمل، اللذين يشعلان حماستك ويشيران إلى مشروع تطرح بصورة إستثنائية وإلى سفر ميز يحمل إليك جديدة. مهما إستدعى العمل جهودا فإنك تبذلها بلا وتحصل على نجاح كبيراً شهر متحرك جدا يحمل مفاجآت في كل مراحله، ويثير حولك التساؤلات كما الغيرة ويجعلك تطيب الخواطر وتتفهم الطبيعة البشرية التي تنتقد دائما نجاح الآخرين. عليك أن تساير وأن تتقبل حتى بعض الإنتقادات والتهكمات بدون جواب أو إستفزاز. ركز على مشاريع التي تبدو مزدهرة حتى أواخر الشهر، وكن حريصا على سلامة اتصالاتك وحاول أن تحسن أسلوبك مع الناس. يساعدك على ذلك الشك الكبير في معرفة طباع الآخرين، فتبدل طریقتك حسب الظروف والأشخاص. قد تلقى في الأسبوع الأول مبلغ من المال أو تكسب بعض الأرباح ويطرأ اللامنتظر احياناً.   ", " تتمختر کملك الغابة وتحسن اختيار الناس المحيطين بك في العمل وتزدهر أعمالك أو تشعر أنت بالغبطة والرضی، پشع بريقك في كل مكان، مع الشمس ومرکور في برجك ومارس في برج صديق هو الحمل. تسكنك حيوية للعمل والنضال لتحقيق الأهداف والطموحات، كما لإحداث التغييرات الضرورية وتبني بعض الأفكار الجديدة والتوجهات العامة وتتحرر من القيود. تتلقى ذبذبات کو کب مارس الممتازة وتتسلح بجرأة وشجاعة نادرتين، فتسير نحو إنجازاتك واثقة وترفع التحديات أمام من يحاول أن يصدك. تتغلب على بعض المنافسين أو على من يحاول إعاقتك في العمل فتحقق النجاح تلو الآخر، حتى ولو تأخرت بعض المشاريع في بعض الفترات. لديك حيوية إستشائية، خاصة في الأسابيع الثلاثة الأولى فتكسب معارك بسهولة وتجني الأرباح. تتلقى الدعم المطلوب من جهات مساعدة أو نافدة  وربما تسافر أو تحسّن في منزلك أو تنتقل إلى جديد "
		   ]
    message=random.choice(liste)
    return render(request,'registration/login3.html',{"message":message})








####################
## SUPER USER :   ##
####################
## name: user     ##
## pswd: user1234 ##
####################